package com.shigu.goodsup.sn.enums;

import com.shigu.goodsup.sn.interfaces.EnumMessage;
import org.apache.commons.lang3.StringUtils;

public enum SnTips implements EnumMessage {
    _101("101","处罚中不允许发布新商品。");
//    _104("运费模板错误，请检查。"),
//    _105("上传失败，请稍后重试。"),
//    _107("电脑端详情必填，且长度不能超过100000个字节，请修改。"),
//    _108("详情中出现错误代码，请修改。"),
//    _109("详情中出现错误代码，请修改。"),
//    _110("电脑端详情中包含外部图片，请修改。"),
//    _111("电脑端详情中包含外部链接，请修改。"),
//    _112("商品卖点必填，且长度不能超过45个字。"),
//    _113("售后服务必填，且长度不能超过200个字。"),
//    _114("商品标题必填，且长度不能超过60个字。"),
//    _115("商品编码长度超过个30字，请修改。"),
//    _118("售价设置有误，请检查。"),
//    _119("商品类目未绑定销售范围；商品类目为空，请检查。"),
//    _120("没有类目或品牌授权，无权操作该商品;品牌为空，请检查。"),
//    _121("请填写商品编码。"),
//    _122("请填写商品标题。"),
//    _123("商品标题长度超过60个字，请修改。"),
//    _124("商品标题已存在，请修改。"),
//    _125("上传失败，请稍后重试。"),
//    _126("资质参数为必填项。"),
//    _127("3C认证不存在，请填写有效的证书编号和生产企业"),
//    _128("子码数量大于1000，请修改。"),
//    _153("存在名称重复的详情模块名称，请修改。"),
//    _154("上传失败，请稍后重试。"),
//    _155("最多编辑10个有内容的自定义详情模块。"),
//    _156("请将自定义详情模块名称或内容维护完整。"),
//    _157("详情模块内容不符合要求，请检查。"),
//    _158("不允许自定义模块顺序；请维护必填的详情模块；电脑端详情请至少上传一张图片;"),
//    _159("您输入的条形码已经存在，请确认是否发布已有。"),
//    _160("资质图必传，请上传！"),
//    _161("资质图大于3，请检查！"),
//    _162("您上传的图片必须为商家自有图片，请重新上传！"),
//    _163("您上传的图片不符合要求，请控制在500kb以内！"),
//    _164("您上传的图片大小必须为800x800的图片！"),
//    _165("子码条形码为必填项。"),
//    _166("子码条形码只能输入数字或大写字母或者13个0，请核查。"),
//    _167("子码条形码不能重复，请检查！"),
//    _168("资质图必传，请上传！"),
//    _169("您上传的图片必须为商家自有图片，请重新上传！"),
//    _170("您上传的图片不符合要求，请控制在500kb以内！"),
//    _171("您上传的图片大小必须为800x800的图片！"),
//    _172("子码商品售价、库存未填写或填写有误，请检查！"),
//    _173("内容含有特殊符号，请重新填写！"),
//    _174("内容含有特殊单位，请重新填写！"),
//    _175("颜色图片为必填项，请检查是否符合以下条件：\n" +
//            "1.您上传的图片必须为商家自有图片；\n" +
//            "2.您上传的图片大小必须为800x800的图片。"),
//    _176("内容含有敏感词，请重新填写！"),
//    _177("前五张图片必传，请补充上传！"),
//    _178("主图不得重复，请重新上传！"),
//    _179("主图不符合要求，请检查是否符合以下条件：\n" +
//            "1.您上传的主图必须为商家自有图片；\n" +
//            "2.您上传的主图大小必须为800x800的图片。"),
//    _180("自定义内容不符合要求，请检查是否符合以下原因：\n" +
//            "1.自定义参数中不能含有非法字符，且总长度不超过30；\n" +
//            "2.不能存在相同的规格值。"),
//    _181("图片不符合要求，请检查是否符合以下条件：\n" +
//            "1.您上传的图片必须为商家自有图片；\n" +
//            "2.您上传的图片大小必须为800x1200的图片,且小于2M。"),
//    _182("当前可申请商品数超出最大数量限制，请删除部分商品数量，释放被占用的商品数量！");

    private String msg;

    private String tip;

    SnTips(String msg,String tip) {
        this.msg = msg;
        this.tip = tip;
    }

    public String getTip() {
        return tip;
    }

    public String getMsg() {
        return msg;
    }

    public static SnTips getSexEnumByCode(String code){
        for(SnTips sexEnum : SnTips.values()){
            if(StringUtils.equals(code, sexEnum.getMsg())){
                return sexEnum;
            }
        }
        return null;
    }

    @Override
    public Object getValue() {
        //此处需要根据枚举对象的哪个属性返回枚举对象，就return该属性
        return msg;
    }

}
